backend/views/default/post/index.php

SELECT * FROM `user` ORDER BY `username`
---
                    ['title'=>'查看用户详情', 'target'=> '_blank']);
            },
            'filterType'=>GridView::FILTER_SELECT2,
            'filter'=>ArrayHelper::map(User::find()->orderBy('username')->asArray()->all(), 'id', 'username'),