common/models/Post.php

SELECT * FROM `user_info`
---
    public function getPostAuthor(){
        return ArrayHelper::map(UserInfo::find()->all(), 'user_id', 'nickname');